### Import Numpy and Pandas Libraries

In [1]:
import numpy as np
import pandas as pd

# Q1. Read the '.csv' file into a data frame and display the first 5 rows.

In [157]:
df=pd.read_csv('C:\\Users\gurun\Desktop\VAC Predictive Analysis Python\Datasets\Forbes_Billionaire.csv')
df

,Rank,Name,Age,Net Worth,Country,Source,Industries
0,1,JEFF BEZOS,56.0,113.0,United States,Amazon,Technology
1,2,BILL GATES,64.0,98.0,United States,Microsoft,Technology
2,3,BERNARD ARNAULT & FAMILY,71.0,76.0,France,LVMH,Fashion & Retail
3,4,WARREN BUFFETT,89.0,67.5,United States,Berkshire Hathaway,Finance & Investments
4,5,LARRY ELLISON,75.0,59.0,United States,software,Technology
...,...,...,...,...,...,...,...
2090,1990,DAVID HALL,68.0,1.0,United States,automotive technology,Automotive
2091,1990,DU SHA,73.0,1.0,China,hypermarkets,Diversified
2092,1990,WANG YANQING,73.0,1.0,China,carbon fiber products,Manufacturing
2093,1990,XU WANMAO,75.0,1.0,China,education,Service
2094,1990,WANG MIAOTONG,62.0,1.0,China,auto parts,Automotive

# Q2. Name the top 8 industries with maximum count of billionaires

In [98]:
#df.groupby('Industries')['Name'].nunique().sort_values(ascending=False).head(8)
df['Name'].groupby(df['Industries']).nunique().sort_values(ascending=False).head(8)

Industries
Finance & Investments    298
Technology               241
Fashion & Retail         209
Manufacturing            198
Real Estate              196
Diversified              169
Food & Beverage          168
Healthcare               149
Name: Name, dtype: int64

# Q3. State the headcount of billionaires from these top 8 industries

In [97]:
#df.groupby('Industries')['Name'].nunique().sort_values(ascending=False).head(8)
df['Name'].groupby(df['Industries']).nunique().sort_values(ascending=False).head(8)

Industries
Finance & Investments    298
Technology               241
Fashion & Retail         209
Manufacturing            198
Real Estate              196
Diversified              169
Food & Beverage          168
Healthcare               149
Name: Name, dtype: int64

# Q4. Compare the mean of net worth of billionaires from these top 8 industries.

In [100]:
#df.groupby("Industries")['Net Worth'].mean().sort_values(ascending=False).head(8)
df['Net Worth'].groupby(df['Industries']).mean().sort_values(ascending=False).head(8)

Industries
Technology               5.634440
Fashion & Retail         5.372727
Telecom                  4.941379
Gambling & Casinos       4.528571
Metals & Mining          4.193220
Energy                   4.067500
Media & Entertainment    3.994595
Food & Beverage          3.708333
Name: Net Worth, dtype: float64

# Q5. Compare the mean age of billionaires from these top 8 industries.

In [101]:
#df.groupby('Industries')['Age'].mean().sort_values().head(8)
df['Age'].groupby(df['Industries']).mean().sort_values().head(8)

Industries
Technology               55.375527
Metals & Mining          60.913793
Healthcare               63.088435
Automotive               63.152174
Manufacturing            64.139896
Service                  64.317460
Telecom                  64.413793
Media & Entertainment    64.760563
Name: Age, dtype: float64

# Q6. Name the Richest billionaire in the Automotive sector

In [254]:
df.loc[df['Industries']=='Automotive'].nlargest(2,'Net Worth')#[['Name','Net Worth']]

,Rank,Name,Age,Net Worth,Country,Source,Industries
30,31,ELON MUSK,48.0,24.6,United States,"Tesla, SpaceX",Automotive
53,54,SUSANNE KLATTEN,57.0,16.8,Germany,"BMW, pharmaceuticals",Automotive

# Q7. Name top 5 countries with maximum number of billionaires.

In [145]:
#df['Name'].groupby(df['Country']).nunique().sort_values(ascending=False).head(5)
df['Name'].groupby(df['Country']).nunique().nlargest(5)

Country
United States    614
China            387
Germany          107
India            102
Russia            99
Name: Name, dtype: int64

# Q8. Name the richest Chinese billionaire and his net worth

In [147]:
#df[df['Country']=='China'].sort_values(by='Net Worth',ascending=False).head(1)
df.loc[df['Country']=='China'].nlargest(1,'Net Worth')

    Rank     Name   Age  Net Worth Country      Source  Industries
16    17  JACK MA  55.0       38.8   China  e-commerce  Technology

# Q9. Name top 5 Industries with maximum number of Indian billionaires.

In [154]:
#df[df['Country']=='India'].groupby('Industries')['Name'].nunique().sort_values(ascending=False).head(5)
df.loc[df['Country']=='India'].groupby(df['Industries']).nunique().nlargest(5,'Name')

                 Rank  Name  Age  Net Worth  Country  Source  Industries
Industries
Healthcare         10    17   13         10        1       5           1
Manufacturing      11    14   12         11        1       9           1
Diversified         9    13   10          9        1       4           1
Technology          7    11    8          7        1       5           1
Food & Beverage     6     8    8          6        1       2           1

# Q10. Name all the Indian billionaires in global top 100 list.

In [155]:
#df.loc[df['Country']=='India'].sort_values('Net Worth',ascending=False).head(100)
df.loc[df['Country']=='India'].nlargest(100,'Net Worth')

,Rank,Name,Age,Net Worth,Country,Source,Industries
20,21,MUKESH AMBANI,62.0,36.8,India,"petrochemicals, oil & gas",Energy
77,78,RADHAKISHAN DAMANI & FAMILY,65.0,13.8,India,"retail, investments",Fashion & Retail
102,103,SHIV NADAR,74.0,11.9,India,software services,Technology
128,129,UDAY KOTAK,61.0,10.4,India,banking,Finance & Investments
154,155,GAUTAM ADANI,57.0,8.9,India,"commodities, ports",Diversified
...,...,...,...,...,...,...,...
1856,1851,BINNY BANSAL,37.0,1.1,India,flipkart,Technology
1867,1851,ACHARYA BALKRISHNA,47.0,1.1,India,consumer goods,Food & Beverage
1888,1851,SANDEEP ENGINEER,58.0,1.1,India,plastic pipes,Manufacturing
1902,1851,S.D. SHIBULAL,65.0,1.1,India,software services,Technology
1970,1851,ARVIND PODDAR,62.0,1.1,India,tires,Automotive

# Q11. Name all the billionaires in India who are younger than 50 years. Also state their mean net worth

In [183]:
IB= df[(df['Country']=='India') & (df['Age']<50)]
IB

,Rank,Name,Age,Net Worth,Country,Source,Industries
874,875,VIJAY SHEKHAR SHARMA,41.0,2.4,India,financial technology,Service
1196,1196,BYJU RAVEENDRAN,38.0,1.8,India,education technology,Technology
1237,1196,VIKAS OBEROI,49.0,1.8,India,real estate,Real Estate
1420,1415,RANJAN PAI,47.0,1.5,India,education,Service
1618,1613,SHAMSHEER VAYALIL,43.0,1.3,India,healthcare,Healthcare
1732,1730,SACHIN BANSAL,38.0,1.2,India,flipkart,Fashion & Retail
1742,1730,RADHA VEMBU,47.0,1.2,India,technology,Technology
1856,1851,BINNY BANSAL,37.0,1.1,India,flipkart,Technology
1867,1851,ACHARYA BALKRISHNA,47.0,1.1,India,consumer goods,Food & Beverage

In [180]:
IB['Net Worth'].mean()

1.4888888888888887

# Q12. Name the Indian billionaires from real estate sector who are richer than 'DONALD TRUMP'.

In [247]:
ib= df[(df['Country']=='India') & (df['Industries']=='Real Estate')]
ib

,Rank,Name,Age,Net Worth,Country,Source,Industries
494,494,KUSHAL PAL SINGH,88.0,3.7,India,real estate,Real Estate
774,764,CHANDRU RAHEJA,79.0,2.7,India,real estate,Real Estate
1237,1196,VIKAS OBEROI,49.0,1.8,India,real estate,Real Estate
1253,1196,MANGAL PRABHAT LODHA,64.0,1.8,India,real estate,Real Estate
1395,1335,JITENDRA VIRWANI,54.0,1.6,India,real estate,Real Estate
1712,1613,NIRANJAN HIRANANDANI,70.0,1.3,India,real estate,Real Estate
1716,1613,SUBHASH RUNWAL,76.0,1.3,India,real estate,Real Estate
1983,1851,MOFATRAJ MUNOT,75.0,1.1,India,real estate,Real Estate

In [251]:
ibr = ib[ib['Net Worth']>df[df['Name']=='DONALD TRUMP']['Net Worth'].values[0]]
ibr

     Rank              Name   Age  Net Worth Country       Source   Industries
494   494  KUSHAL PAL SINGH  88.0        3.7   India  real estate  Real Estate
774   764    CHANDRU RAHEJA  79.0        2.7   India  real estate  Real Estate

# Q13. What is the total cumulative net worth of all the billionaires?

In [252]:
df['Net Worth'].cumsum()

0        113.0
1        211.0
2        287.0
3        354.5
4        413.5
         ...
2090    8033.5
2091    8034.5
2092    8035.5
2093    8036.5
2094    8037.5
Name: Net Worth, Length: 2095, dtype: float64

In [253]:
df['Net Worth'].sum()

8037.499999999999

# END